Revit 2027 API
RebarShapeConstraintSagittaLength Class
 A constraint that can be applied to a RebarShapeDefinitionByArc and drives the height of the arc.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Structure.RebarShapeConstraint
 Autodesk.Revit.DB.Structure.RebarShapeConstraintSagittaLength
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class RebarShapeConstraintSagittaLength : RebarShapeConstraint
Public Class RebarShapeConstraintSagittaLength
	Inherits RebarShapeConstraint
public ref class RebarShapeConstraintSagittaLength : public RebarShapeConstraint
type RebarShapeConstraintSagittaLength =
    class
        inherit RebarShapeConstraint
    end
The RebarShapeConstraintSagittaLength type exposes the following members.
Constructors
Name | Description
RebarShapeConstraintSagittaLength |  Create a constraint to drive sagitta length.
Top
Properties
Name | Description
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
(Inherited from RebarShapeConstraint)
Top
Methods
Name | Description
Dispose
(Inherited from RebarShapeConstraint)
Equals | Determines whether the specified object is equal to the current object.
(Inherited from Object)
GetHashCode | Serves as the default hash function.
(Inherited from Object)
GetParamId |  Return the Id of the parameter associated with this constraint.
(Inherited from RebarShapeConstraint)
GetType | Gets the Type of the current instance.
(Inherited from Object)
ToString | Returns a string that represents the current object.
(Inherited from Object)
Top
See Also
Reference
Autodesk.Revit.DB.Structure Namespace